#include <iostream>
#include "Timer.cpp"

using namespace std;

int main(){
/*
  Программа с помощью класса Timer позволяет увидить эфффект скачка по
  памяти при суммировании по строкам и по столбцам.

 */
    Timer t;
   int A[5][9] = {{1, 2, 3, 5, 6, 7, 8, 9, 10,},
                   {4, 5, 6, 7, 8, 8, 10, 11, 12},
                   {1, 2, 3, 5, 6, 7, 8, 9, 10,},
                   {1, 2, 3, 5, 6, 7, 8, 9, 10,},
                   {7, 8, 9, 10, 11, 12, 13, 14, 15}};
    

    int B[5][9] = {{1, 2, 3, 5, 6, 7, 8, 9, 10,},
                    {4, 5, 6, 7, 8, 8, 10, 11, 12},
                    {1, 2, 3, 5, 6, 7, 8, 9, 10,},
                    {1, 2, 3, 5, 6, 7, 8, 9, 10,},
                    {7, 8, 9, 10, 11, 12, 13, 14, 15}};
    
    int Sum[5][9];    
    
    for(int i = 0; i < 5; i++){
        for(int j = 0; j < 9; j++){
            Sum[j][i] = A[j][i] + B[j][i];
            cout << Sum[j][i] << endl;
        }
        cout << '\n';
    }
    return 0;
}
